apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_ccm.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/rt117x/imxrt117x_ccm.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_CCM_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_CCM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/imxrt_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define IMXRT_CCM_CR_CTRL_OFFSET(n)         (0x0000 + ((n) << 7)) /* Clock root control (CLOCK_ROOTn_CONTROL, n=0..78) */
#define IMXRT_CCM_CR_CTRL_SET_OFFSET(n)     (0x0004 + ((n) << 7)) /* Clock root control (CLOCK_ROOTn_CONTROL_SET, n=0..78) */
#define IMXRT_CCM_CR_CTRL_CLR_OFFSET(n)     (0x0008 + ((n) << 7)) /* Clock root control (CLOCK_ROOTn_CONTROL_CLR, n=0..78) */
#define IMXRT_CCM_CR_CTRL_TOG_OFFSET(n)     (0x000c + ((n) << 7)) /* Clock root control (CLOCK_ROOTn_CONTROL_TOG, n=0..78) */
#define IMXRT_CCM_CR_STAT0_OFFSET(n)        (0x0020 + ((n) << 7)) /* Clock root working status (CLOCK_ROOTn_STATUS0, n=0..78) */
#define IMXRT_CCM_CR_STAT1_OFFSET(n)        (0x0024 + ((n) << 7)) /* Clock root low power status (CLOCK_ROOTn_STATUS1, n=0..78) */
#define IMXRT_CCM_CR_CFG_OFFSET(n)          (0x002c + ((n) << 7)) /* Clock root configuration (CLOCK_ROOTn_CONFIG, n=0..78) */
#define IMXRT_CCM_CR_AUTH_OFFSET(n)         (0x0030 + ((n) << 7)) /* Clock root access control (CLOCK_ROOTn_AUTHEN, n=0..78) */
#define IMXRT_CCM_CR_AUTH_SET_OFFSET(n)     (0x0034 + ((n) << 7)) /* Clock root access control (CLOCK_ROOTn_AUTHEN_SET, n=0..78) */
#define IMXRT_CCM_CR_AUTH_CLR_OFFSET(n)     (0x0038 + ((n) << 7)) /* Clock root access control (CLOCK_ROOTn_AUTHEN_CLR, n=0..78) */
#define IMXRT_CCM_CR_AUTH_TOG_OFFSET(n)     (0x003c + ((n) << 7)) /* Clock root access control (CLOCK_ROOTn_AUTHEN_TOG, n=0..78) */
#define IMXRT_CCM_CR_COUNT                  79                    /* Count of clock roots */

#define IMXRT_CCM_CR_SETP_OFFSET(n,m)       (0x0040 + ((n) << 7) + ((m) << 2)) /* Setpoint setting (CLOCK_ROOTn_SETPOINTm, n=0..78, m=0..15) */

#define IMXRT_CCM_CG_CTRL_OFFSET(n)         (0x4000 + ((n) << 7)) /* Clock group control (CLOCK_GROUPn_CONTROL, n=0..1) */
#define IMXRT_CCM_CG_CTRL_SET_OFFSET(n)     (0x4004 + ((n) << 7)) /* Clock group control (CLOCK_GROUPn_CONTROL_SET, n=0..1) */
#define IMXRT_CCM_CG_CTRL_CLR_OFFSET(n)     (0x4008 + ((n) << 7)) /* Clock group control (CLOCK_GROUPn_CONTROL_CLR, n=0..1) */
#define IMXRT_CCM_CG_CTRL_TOG_OFFSET(n)     (0x400c + ((n) << 7)) /* Clock group control (CLOCK_GROUPn_CONTROL_TOG, n=0..1) */
#define IMXRT_CCM_CG_STAT0_OFFSET(n)        (0x4020 + ((n) << 7)) /* Clock group working status (CLOCK_GROUPn_STATUS0, n=0..1) */
#define IMXRT_CCM_CG_STAT1_OFFSET(n)        (0x4024 + ((n) << 7)) /* Clock group low power/extended status (CLOCK_GROUPn_STATUS1, n=0..1) */
#define IMXRT_CCM_CG_CFG_OFFSET(n)          (0x402c + ((n) << 7)) /* Clock group configuration (CLOCK_GROUPn_CONFIG, n=0..1) */
#define IMXRT_CCM_CG_AUTH_OFFSET(n)         (0x4030 + ((n) << 7)) /* Clock group access control (CLOCK_GROUPn_AUTHEN, n=0..1) */
#define IMXRT_CCM_CG_AUTH_SET_OFFSET(n)     (0x4034 + ((n) << 7)) /* Clock group access control (CLOCK_GROUPn_AUTHEN_SET, n=0..1) */
#define IMXRT_CCM_CG_AUTH_CLR_OFFSET(n)     (0x4038 + ((n) << 7)) /* Clock group access control (CLOCK_GROUPn_AUTHEN_CLR, n=0..1) */
#define IMXRT_CCM_CG_AUTH_TOG_OFFSET(n)     (0x403c + ((n) << 7)) /* Clock group access control (CLOCK_GROUPn_AUTHEN_TOG, n=0..1) */

#define IMXRT_CCM_CG_SETP_OFFSET(n,m)       (0x4040 + ((n) << 7) + ((m) << 2)) /* Setpoint setting (CLOCK_GROUPn_SETPOINTm, n=0..1, m=0..15) */

#define IMXRT_CCM_GPR_SH_OFFSET(n)          (0x4800 + ((n) << 5)) /* General Purpose Register (GPR_SHAREDn, n=0..7) */
#define IMXRT_CCM_GPR_SH_SET_OFFSET(n)      (0x4804 + ((n) << 5)) /* General Purpose Register (GPR_SHAREDn_SET, n=0..7) */
#define IMXRT_CCM_GPR_SH_CLR_OFFSET(n)      (0x4808 + ((n) << 5)) /* General Purpose Register (GPR_SHAREDn_CLR, n=0..7) */
#define IMXRT_CCM_GPR_SH_TOG_OFFSET(n)      (0x480c + ((n) << 5)) /* General Purpose Register (GPR_SHAREDn_TOG, n=0..7) */
#define IMXRT_CCM_GPR_SH_AUTH_OFFSET(n)     (0x4810 + ((n) << 5)) /* General Purpose Register (GPR_SHAREDn_AUTHEN, n=0..7) */
#define IMXRT_CCM_GPR_SH_AUTH_SET_OFFSET(n) (0x4814 + ((n) << 5)) /* General Purpose Register (GPR_SHAREDn_AUTHEN_SET, n=0..7) */
#define IMXRT_CCM_GPR_SH_AUTH_CLR_OFFSET(n) (0x4818 + ((n) << 5)) /* General Purpose Register (GPR_SHAREDn_AUTHEN_CLR, n=0..7) */
#define IMXRT_CCM_GPR_SH_AUTH_TOG_OFFSET(n) (0x481c + ((n) << 5)) /* General Purpose Register (GPR_SHAREDn_AUTHEN_TOG, n=0..7) */

#define IMXRT_CCM_GPR_PR_OFFSET(n)          (0x4c20 + (((n)-1) << 5)) /* General Purpose Register (GPR_PRIVATEn, n=1..7) */
#define IMXRT_CCM_GPR_PR_SET_OFFSET(n)      (0x4c24 + (((n)-1) << 5)) /* General Purpose Register (GPR_PRIVATEn_SET, n=1..7) */
#define IMXRT_CCM_GPR_PR_CLR_OFFSET(n)      (0x4c28 + (((n)-1) << 5)) /* General Purpose Register (GPR_PRIVATEn_CLR, n=1..7) */
#define IMXRT_CCM_GPR_PR_TOG_OFFSET(n)      (0x4c2c + (((n)-1) << 5)) /* General Purpose Register (GPR_PRIVATEn_TOG, n=1..7) */
#define IMXRT_CCM_GPR_PR_AUTH_OFFSET(n)     (0x4c30 + (((n)-1) << 5)) /* General Purpose Register (GPR_PRIVATEn_AUTHEN, n=1..7) */
#define IMXRT_CCM_GPR_PR_AUTH_SET_OFFSET(n) (0x4c34 + (((n)-1) << 5)) /* General Purpose Register (GPR_PRIVATEn_AUTHEN_SET, n=1..7) */
#define IMXRT_CCM_GPR_PR_AUTH_CLR_OFFSET(n) (0x4c38 + (((n)-1) << 5)) /* General Purpose Register (GPR_PRIVATEn_AUTHEN_CLR, n=1..7) */
#define IMXRT_CCM_GPR_PR_AUTH_TOG_OFFSET(n) (0x4c3c + (((n)-1) << 5)) /* General Purpose Register (GPR_PRIVATEn_AUTHEN_TOG, n=1..7) */

#define IMXRT_CCM_OSCPLL_DIR_OFFSET(n)      (0x5000 + ((n) << 5)) /* Clock source direct control (OSCPLLn_DIRECT, n=0..28) */
#define IMXRT_CCM_OSCPLL_DOM_OFFSET(n)      (0x5004 + ((n) << 5)) /* Clock source domain control (OSCPLLn_DOMAIN, n=0..28) */
#define IMXRT_CCM_OSCPLL_SETP_OFFSET(n)     (0x5008 + ((n) << 5)) /* Clock source setpoint setting (OSCPLLn_SETPOINT, n=0..28) */
#define IMXRT_CCM_OSCPLL_STAT0_OFFSET(n)    (0x5010 + ((n) << 5)) /* Clock source working status (OSCPLLn_STATUS0, n=0..28) */
#define IMXRT_CCM_OSCPLL_STAT1_OFFSET(n)    (0x5014 + ((n) << 5)) /* Clock source low power status (OSCPLLn_STATUS1, n=0..28) */
#define IMXRT_CCM_OSCPLL_CFG_OFFSET(n)      (0x5018 + ((n) << 5)) /* Clock source configuration (OSCPLLn_CONFIG, n=0..28) */
#define IMXRT_CCM_OSCPLL_AUTH_OFFSET(n)     (0x501c + ((n) << 5)) /* Clock source access control (OSCPLLn_AUTHEN, n=0..28) */

#define IMXRT_CCM_LPCG_DIR_OFFSET(n)        (0x6000 + ((n) << 5)) /* LPCG direct control (LPCGn_DIRECT, n=0..137) */
#define IMXRT_CCM_LPCG_DOM_OFFSET(n)        (0x6004 + ((n) << 5)) /* LPCG domain control (LPCGn_DOMAIN, n=0..137) */
#define IMXRT_CCM_LPCG_STAT0_OFFSET(n)      (0x6010 + ((n) << 5)) /* LPCG working status (LPCGn_STATUS0, n=0..137) */
#define IMXRT_CCM_LPCG_STAT1_OFFSET(n)      (0x6014 + ((n) << 5)) /* LPCG low power status (LPCGn_STATUS1, n=0..137) */
#define IMXRT_CCM_LPCG_CFG_OFFSET(n)        (0x6018 + ((n) << 5)) /* LPCG configuration (LPCGn_CONFIG, n=0..137) */
#define IMXRT_CCM_LPCG_AUTH_OFFSET(n)       (0x601c + ((n) << 5)) /* LPCG access control (LPCGn_AUTHEN, n=0..137) */

#define IMXRT_CCM_LPCG_SETP_OFFSET(n)       (0x6048 + (((n)-2) << 5)) /* LPCG setpoint setting (LPCGn_SETPOINT, n=2..48) */

