apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_ccm.h
/* Register addresses *******************************************************/

#define IMXRT_CCM_CR_CTRL(n)                (IMXRT_CCM_BASE + IMXRT_CCM_CR_CTRL_OFFSET(n))
#define IMXRT_CCM_CR_CTRL_SET(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CR_CTRL_SET_OFFSET(n))
#define IMXRT_CCM_CR_CTRL_CLR(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CR_CTRL_CLR_OFFSET(n))
#define IMXRT_CCM_CR_CTRL_TOG(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CR_CTRL_TOG_OFFSET(n))
#define IMXRT_CCM_CR_STAT0(n)               (IMXRT_CCM_BASE + IMXRT_CCM_CR_STAT0_OFFSET(n))
#define IMXRT_CCM_CR_STAT1(n)               (IMXRT_CCM_BASE + IMXRT_CCM_CR_STAT1_OFFSET(n))
#define IMXRT_CCM_CR_CFG(n)                 (IMXRT_CCM_BASE + IMXRT_CCM_CR_CFG_OFFSET(n))
#define IMXRT_CCM_CR_AUTH(n)                (IMXRT_CCM_BASE + IMXRT_CCM_CR_AUTH_OFFSET(n))
#define IMXRT_CCM_CR_AUTH_SET(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CR_AUTH_SET_OFFSET(n))
#define IMXRT_CCM_CR_AUTH_CLR(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CR_AUTH_CLR_OFFSET(n))
#define IMXRT_CCM_CR_AUTH_TOG(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CR_AUTH_TOG_OFFSET(n))
#define IMXRT_CCM_CR_SETP(n,m)              (IMXRT_CCM_BASE + IMXRT_CCM_CR_SETP_OFFSET(n,m))

#define IMXRT_CCM_CG_CTRL(n)                (IMXRT_CCM_BASE + IMXRT_CCM_CG_CTRL_OFFSET(n))
#define IMXRT_CCM_CG_CTRL_SET(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CG_CTRL_SET_OFFSET(n))
#define IMXRT_CCM_CG_CTRL_CLR(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CG_CTRL_CLR_OFFSET(n))
#define IMXRT_CCM_CG_CTRL_TOG(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CG_CTRL_TOG_OFFSET(n))
#define IMXRT_CCM_CG_STAT0(n)               (IMXRT_CCM_BASE + IMXRT_CCM_CG_STAT0_OFFSET(n))
#define IMXRT_CCM_CG_STAT1(n)               (IMXRT_CCM_BASE + IMXRT_CCM_CG_STAT1_OFFSET(n))
#define IMXRT_CCM_CG_CFG(n)                 (IMXRT_CCM_BASE + IMXRT_CCM_CG_CFG_OFFSET(n))
#define IMXRT_CCM_CG_AUTH(n)                (IMXRT_CCM_BASE + IMXRT_CCM_CG_AUTH_OFFSET(n))
#define IMXRT_CCM_CG_AUTH_SET(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CG_AUTH_SET_OFFSET(n))
#define IMXRT_CCM_CG_AUTH_CLR(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CG_AUTH_CLR_OFFSET(n))
#define IMXRT_CCM_CG_AUTH_TOG(n)            (IMXRT_CCM_BASE + IMXRT_CCM_CG_AUTH_TOG_OFFSET(n))
#define IMXRT_CCM_CG_SETP(n,m)              (IMXRT_CCM_BASE + IMXRT_CCM_CG_SETP_OFFSET(n,m))

#define IMXRT_CCM_GPR_SH(n)                 (IMXRT_CCM_BASE + IMXRT_CCM_GPR_SH_OFFSET(n))
#define IMXRT_CCM_GPR_SH_SET(n)             (IMXRT_CCM_BASE + IMXRT_CCM_GPR_SH_SET_OFFSET(n))
#define IMXRT_CCM_GPR_SH_CLR(n)             (IMXRT_CCM_BASE + IMXRT_CCM_GPR_SH_CLR_OFFSET(n))
#define IMXRT_CCM_GPR_SH_TOG(n)             (IMXRT_CCM_BASE + IMXRT_CCM_GPR_SH_TOG_OFFSET(n))
#define IMXRT_CCM_GPR_SH_AUTH(n)            (IMXRT_CCM_BASE + IMXRT_CCM_GPR_SH_AUTH_OFFSET(n))
#define IMXRT_CCM_GPR_SH_AUTH_SET(n)        (IMXRT_CCM_BASE + IMXRT_CCM_GPR_SH_AUTH_SET_OFFSET(n))
#define IMXRT_CCM_GPR_SH_AUTH_CLR(n)        (IMXRT_CCM_BASE + IMXRT_CCM_GPR_SH_AUTH_CLR_OFFSET(n))
#define IMXRT_CCM_GPR_SH_AUTH_TOG(n)        (IMXRT_CCM_BASE + IMXRT_CCM_GPR_SH_AUTH_TOG_OFFSET(n))

#define IMXRT_CCM_GPR_PR(n)                 (IMXRT_CCM_BASE + IMXRT_CCM_GPR_PR_OFFSET(n))
#define IMXRT_CCM_GPR_PR_SET(n)             (IMXRT_CCM_BASE + IMXRT_CCM_GPR_PR_SET_OFFSET(n))
#define IMXRT_CCM_GPR_PR_CLR(n)             (IMXRT_CCM_BASE + IMXRT_CCM_GPR_PR_CLR_OFFSET(n))
#define IMXRT_CCM_GPR_PR_TOG(n)             (IMXRT_CCM_BASE + IMXRT_CCM_GPR_PR_TOG_OFFSET(n))
#define IMXRT_CCM_GPR_PR_AUTH(n)            (IMXRT_CCM_BASE + IMXRT_CCM_GPR_PR_AUTH_OFFSET(n))
#define IMXRT_CCM_GPR_PR_AUTH_SET(n)        (IMXRT_CCM_BASE + IMXRT_CCM_GPR_PR_AUTH_SET_OFFSET(n))
#define IMXRT_CCM_GPR_PR_AUTH_CLR(n)        (IMXRT_CCM_BASE + IMXRT_CCM_GPR_PR_AUTH_CLR_OFFSET(n))
#define IMXRT_CCM_GPR_PR_AUTH_TOG(n)        (IMXRT_CCM_BASE + IMXRT_CCM_GPR_PR_AUTH_TOG_OFFSET(n))

#define IMXRT_CCM_OSCPLL_DIR(n)             (IMXRT_CCM_BASE + IMXRT_CCM_OSCPLL_DIR_OFFSET(n))
#define IMXRT_CCM_OSCPLL_DOM(n)             (IMXRT_CCM_BASE + IMXRT_CCM_OSCPLL_DOM_OFFSET(n))
#define IMXRT_CCM_OSCPLL_SETP(n)            (IMXRT_CCM_BASE + IMXRT_CCM_OSCPLL_SETP_OFFSET(n))
#define IMXRT_CCM_OSCPLL_STAT0(n)           (IMXRT_CCM_BASE + IMXRT_CCM_OSCPLL_STAT0_OFFSET(n))
#define IMXRT_CCM_OSCPLL_STAT1(n)           (IMXRT_CCM_BASE + IMXRT_CCM_OSCPLL_STAT1_OFFSET(n))
#define IMXRT_CCM_OSCPLL_CFG(n)             (IMXRT_CCM_BASE + IMXRT_CCM_OSCPLL_CFG_OFFSET(n))
#define IMXRT_CCM_OSCPLL_AUTH(n)            (IMXRT_CCM_BASE + IMXRT_CCM_OSCPLL_AUTH_OFFSET(n))

#define IMXRT_CCM_LPCG_DIR(n)               (IMXRT_CCM_BASE + IMXRT_CCM_LPCG_DIR_OFFSET(n))
#define IMXRT_CCM_LPCG_DOM(n)               (IMXRT_CCM_BASE + IMXRT_CCM_LPCG_DOM_OFFSET(n))
#define IMXRT_CCM_LPCG_STAT0(n)             (IMXRT_CCM_BASE + IMXRT_CCM_LPCG_STAT0_OFFSET(n))
#define IMXRT_CCM_LPCG_STAT1(n)             (IMXRT_CCM_BASE + IMXRT_CCM_LPCG_STAT1_OFFSET(n))
#define IMXRT_CCM_LPCG_CFG(n)               (IMXRT_CCM_BASE + IMXRT_CCM_LPCG_CFG_OFFSET(n))
#define IMXRT_CCM_LPCG_AUTH(n)              (IMXRT_CCM_BASE + IMXRT_CCM_LPCG_AUTH_OFFSET(n))
#define IMXRT_CCM_LPCG_SETP(n)              (IMXRT_CCM_BASE + IMXRT_CCM_LPCG_SETP_OFFSET(n))

/* Register bit definitions *************************************************/

/* Clock root control (CLOCK_ROOTn_CONTROL, n=0..78) */

#define CCM_CR_CTRL_DIV_SHIFT             (0)       /* Bits 0-7:   Divide selected clock by DIV+1 (DIV) */
#define CCM_CR_CTRL_DIV_MASK              (0xff << CCM_CR_CTRL_DIV_SHIFT)
#  define CCM_CR_CTRL_DIV(n)              (((n)-1) << CCM_CR_CTRL_DIV_SHIFT) /* Divide selected clock by n */

#define CCM_CR_CTRL_MUX_SHIFT             (8)       /* Bits 8-10:  Select clock from 8 clock sources (MUX) */
#define CCM_CR_CTRL_MUX_MASK              (0x07 << CCM_CR_CTRL_MUX_SHIFT)
#  define CCM_CR_CTRL_MUX_SRCSEL(n)       ((n) << CCM_CR_CTRL_MUX_SHIFT) /* Select clock source n */

                                                    /* Bits 11-23: Reserved */
#define CCM_CR_CTRL_OFF                   (1 << 24) /* Bit 24:     Shutdown clock root (OFF) */
                                                    /* Bits 25-31: Reserved */

/* Clock root working status (CLOCK_ROOTn_STATUS0, n=0..78) */

#define CCM_CR_STAT0_DIV_SHIFT            (0)       /* Bits 0-7:   Current clock root DIV setting (DIV) */
#define CCM_CR_STAT0_DIV_MASK             (0xff << CCM_CR_STAT0_DIV_SHIFT)
#define CCM_CR_STAT0_MUX_SHIFT            (8)       /* Bits 8-10:  Current clock root MUX setting (MUX) */
#define CCM_CR_STAT0_MUX_MASK             (0x07 << CCM_CR_STAT0_MUX_SHIFT)
                                                    /* Bits 11-23: Reserved */
#define CCM_CR_STAT0_OFF                  (1 << 24) /* Bit 24:     Current clock root OFF setting (OFF) */
                                                    /* Bits 25-26: Reserved */
#define CCM_CR_STAT0_POWERDOWN            (1 << 27) /* Bit 27:     Current clock root POWERDOWN setting (POWERDOWN) */
#define CCM_CR_STAT0_SLICE_BUSY           (1 << 28) /* Bit 28:     Clock generation logic is applying the new setting (SLICE_BUSY) */
#define CCM_CR_STAT0_UPDATE_FORWARD       (1 << 29) /* Bit 29:     Status synchronization from clock generation logic is in progress (UPDATE_FORWARD) */
#define CCM_CR_STAT0_UPDATE_REVERSE       (1 << 30) /* Bit 30:     Status synchronization to clock generation logic is in progress (UPDATE_REVERSE) */
#define CCM_CR_STAT0_CHANGING             (1 << 31) /* Bit 31:     Clock generation logic is updating currently (CHANGING) */

/* Clock root low power status (CLOCK_ROOTn_STATUS1, n=0..78) */

                                                    /* Bits 0-15:  Reserved */
#define CCM_CR_STAT1_TARGET_SETPOINT_SHIFT  (16)    /* Bits 16-19: Setpoint value to which SoC will switch (TARGET_SETPOINT) */
#define CCM_CR_STAT1_TARGET_SETPOINT_MASK   (0x0f << CCM_CR_STAT1_TARGET_SETPOINT_SHIFT)
#define CCM_CR_STAT1_CURRENT_SETPOINT_SHIFT (20)    /* Bits 20-23: Setpoint value in which SoC is currently working (CURRENT_SETPOINT) */
#define CCM_CR_STAT1_CURRENT_SETPOINT_MASK  (0x0f << CCM_CR_STAT1_CURRENT_SETPOINT_SHIFT)

#define CCM_CR_STAT1_DOWN_REQUEST         (1 << 24) /* Bit 24:     Clock frequency decrease requested (DOWN_REQUEST) */
#define CCM_CR_STAT1_DOWN_DONE            (1 << 25) /* Bit 25:     Clock frequency decrease completed (DOWN_DONE) */
#define CCM_CR_STAT1_UP_REQUEST           (1 << 26) /* Bit 26:     Clock frequency increase requested (UP_REQUEST) */
#define CCM_CR_STAT1_UP_DONE              (1 << 27) /* Bit 27:     Clock frequency increase completed (UP_DONE) */
                                                    /* Bits 28-31: Reserved */

