apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_ccm.h
/* Clock root configuration (CLOCK_ROOTn_CONFIG, n=0..78) */

                                                    /* Bits 0-3:   Reserved */
#define CCM_CR_CFG_SETPOINT_PRESENT       (1 << 4)  /* Bit 4:      Setpoint is implemented (SETPOINT_PRESENT) */
                                                    /* Bits 5-31:  Reserved */

/* Clock root access control (CLOCK_ROOTn_AUTHEN, n=0..78) */

#define CCM_CR_AUTH_TZ_USER               (1 << 0)  /* Bit 0:      Clock root can be changed in user mode (TZ_USER) */
#define CCM_CR_AUTH_TZ_NS                 (1 << 1)  /* Bit 1:      Clock root can be changed in non-secure mode (TZ_NS) */
                                                    /* Bits 2-3:   Reserved */
#define CCM_CR_AUTH_LOCK_TZ               (1 << 4)  /* Bit 4:      Lock TrustZone settings (LOCK_TZ) */
                                                    /* Bits 5-7:   Reserved */
#define CCM_CR_AUTH_WHITE_LIST_SHIFT      (8)       /* Bits 8-11:  Allow domains to change clock (WHITE_LIST) */
#define CCM_CR_AUTH_WHITE_LIST_MASK       (0x0f << CCM_CR_AUTH_WHITE_LIST_SHIFT)
#  define CCM_CR_AUTH_WHITE_LIST_DOMAIN0  (0x01 << CCM_CR_AUTH_WHITE_LIST_SHIFT) /* Allow domain 0 to change clock */
#  define CCM_CR_AUTH_WHITE_LIST_DOMAIN1  (0x02 << CCM_CR_AUTH_WHITE_LIST_SHIFT) /* Allow domain 1 to change clock */
#  define CCM_CR_AUTH_WHITE_LIST_DOMAIN2  (0x04 << CCM_CR_AUTH_WHITE_LIST_SHIFT) /* Allow domain 2 to change clock */
#  define CCM_CR_AUTH_WHITE_LIST_DOMAIN3  (0x08 << CCM_CR_AUTH_WHITE_LIST_SHIFT) /* Allow domain 3 to change clock */

#define CCM_CR_AUTH_LOCK_LIST             (1 << 12) /* Bit 12:     Lock whitelist settings (LOCK_LIST) */
                                                    /* Bits 13-15: Reserved */
#define CCM_CR_AUTH_DOMAIN_MODE           (1 << 16) /* Bit 16:     Low power and access control by domain (DOMAIN_MODE) */
#define CCM_CR_AUTH_SETPOINT_MODE         (1 << 17) /* Bit 17:     Low power and access control by setpoint (SETPOINT_MODE) */
                                                    /* Bits 18-19: Reserved */
#define CCM_CR_AUTH_LOCK_MODE             (1 << 20) /* Bit 20:     Lock low power and access mode (LOCK_MODE) */
                                                    /* Bits 21-31: Reserved */

/* Setpoint setting (CLOCK_ROOTn_SETPOINTm, m=0..15, n=0..78) */

#define CCM_CR_SETP_DIV_SHIFT             (0)       /* Bits 0-7:   Clock divider value in setpoint (DIV) */
#define CCM_CR_SETP_DIV_MASK              (0xff << CCM_CR_CTRL_DIV_SHIFT)
#define CCM_CR_SETP_MUX_SHIFT             (8)       /* Bits 8-10:  Clock multiplexer value in setpoint (MUX) */
#define CCM_CR_SETP_MUX_MASK              (0x07 << CCM_CR_CTRL_MUX_SHIFT)
                                                    /* Bits 11-23: Reserved */
#define CCM_CR_SETP_OFF                   (1 << 24) /* Bit 24:     OFF value in setpoint (OFF) */
                                                    /* Bits 25-27: Reserved */
#define CCM_CR_SETP_GRADE_SHIFT           (28)      /* Bits 28-31: Indicate speed grade for each setpoint setting (GRADE) */
#define CCM_CR_SETP_GRADE_MASK            (0x0f << CCM_CR_SETP_GRADE_SHIFT)

/* Clock group control (CLOCK_GROUPn_CONTROL, n=0..1) */

#define CCM_CG_CTRL_DIV0_SHIFT            (0)       /* Bits 0-3:   Divide clock root by DIV+1 (DIV0) */
#define CCM_CG_CTRL_DIV0_MASK             (0x0f << CCM_CG_CTRL_DIV0_SHIFT)
#  define CCM_CG_CTRL_DIV0(n)             (((n)-1) << CCM_CG_CTRL_DIV0_SHIFT) /* Divide selected clock by n */

                                                    /* Bits 4-15:  Reserved */
#define CCM_CG_CTRL_RSTDIV_SHIFT          (16)      /* Bits 16-23: Clock group global restart count (RSTDIV) */
#define CCM_CG_CTRL_RSTDIV_MASK           (0xff << CCM_CG_CTRL_RSTDIV_SHIFT)
#define CCM_CG_CTRL_OFF                   (1 << 24) /* Bit 24:     Shutdown all clocks in clock group (OFF) */
                                                    /* Bits 25-31: Reserved */

/* Clock group working status (CLOCK_GROUPn_STATUS0, n=0..1) */

#define CCM_CG_STAT0_DIV0_SHIFT           (0)       /* Bits 0-3:   Current clock group DIV0 setting (DIV0) */
#define CCM_CG_STAT0_DIV0_MASK            (0x0f << CCM_CG_STAT0_DIV0_SHIFT)
                                                    /* Bits 4-15:  Reserved */
#define CCM_CG_STAT0_RSTDIV_SHIFT         (16)      /* Bits 16-23: Current clock group RSTDIV setting (RSTDIV) */
#define CCM_CG_STAT0_RSTDIV_MASK          (0xff << CCM_CG_STAT0_RSTDIV_SHIFT)
#define CCM_CG_STAT0_OFF                  (1 << 24) /* Bit 24:     Current clock group OFF setting (OFF) */
                                                    /* Bits 25-26: Reserved */
#define CCM_CG_STAT0_POWERDOWN            (1 << 27) /* Bit 27:     Current clock group POWERDOWN setting (POWERDOWN) */
#define CCM_CG_STAT0_SLICE_BUSY           (1 << 28) /* Bit 28:     Clock generation logic is applying the new setting (SLICE_BUSY) */
#define CCM_CG_STAT0_UPDATE_FORWARD       (1 << 29) /* Bit 29:     Status synchronization from clock generation logic is in progress (UPDATE_FORWARD) */
#define CCM_CG_STAT0_UPDATE_REVERSE       (1 << 30) /* Bit 30:     Status synchronization to clock generation logic is in progress (UPDATE_REVERSE) */
#define CCM_CG_STAT0_CHANGING             (1 << 31) /* Bit 31:     Clock generation logic is updating currently (CHANGING) */

/* Clock group low power/extended status (CLOCK_GROUPn_STATUS1, n=0..1) */

                                                    /* Bits 0-15:  Reserved */
#define CCM_CG_STAT1_TARGET_SETPOINT_SHIFT  (16)    /* Bits 16-19: Setpoint value to which SoC will switch (TARGET_SETPOINT) */
#define CCM_CG_STAT1_TARGET_SETPOINT_MASK   (0x0f << CCM_CG_STAT1_TARGET_SETPOINT_SHIFT)
#define CCM_CG_STAT1_CURRENT_SETPOINT_SHIFT (20)    /* Bits 20-23:  Setpoint value in which SoC is currently working (CURRENT_SETPOINT) */
#define CCM_CG_STAT1_CURRENT_SETPOINT_MASK  (0x0f << CCM_CG_STAT1_CURRENT_SETPOINT_SHIFT)

#define CCM_CG_STAT1_DOWN_REQUEST         (1 << 24) /* Bit 24:     Clock frequency decrease requested (DOWN_REQUEST) */
#define CCM_CG_STAT1_DOWN_DONE            (1 << 25) /* Bit 25:     Clock frequency decrease completed (DOWN_DONE) */
#define CCM_CG_STAT1_UP_REQUEST           (1 << 26) /* Bit 26:     Clock frequency increase requested (UP_REQUEST) */
#define CCM_CG_STAT1_UP_DONE              (1 << 27) /* Bit 27:     Clock frequency increase completed (UP_DONE) */
                                                    /* Bits 28-31: Reserved */

/* Clock group configuration (CLOCK_GROUPn_CONFIG, n=0..1) */

                                                    /* Bits 0-3:   Reserved */
#define CCM_CG_CFG_SETPOINT_PRESENT       (1 << 4)  /* Bit 4:      Setpoint is implemented (SETPOINT_PRESENT) */
                                                    /* Bits 5-31:  Reserved */

/* Clock group access control (CLOCK_GROUPn_AUTHEN, n=0..1) */

#define CCM_CG_AUTH_TZ_USER               (1 << 0)  /* Bit 0:      Clock group can be changed in user mode (TZ_USER) */
#define CCM_CG_AUTH_TZ_NS                 (1 << 1)  /* Bit 1:      Clock group can be changed in non-secure mode (TZ_NS) */
                                                    /* Bits 2-3:   Reserved */
#define CCM_CG_AUTH_LOCK_TZ               (1 << 4)  /* Bit 4:      Lock TrustZone settings (LOCK_TZ) */
                                                    /* Bits 5-7:   Reserved */
#define CCM_CG_AUTH_WHITE_LIST_SHIFT      (8)       /* Bits 8-11:  Allow domains to change clock (WHITE_LIST) */
#define CCM_CG_AUTH_WHITE_LIST_MASK       (0x0f << CCM_CG_AUTH_WHITE_LIST_SHIFT)
#  define CCM_CG_AUTH_WHITE_LIST_DOMAIN0  (0x01 << CCM_CG_AUTH_WHITE_LIST_SHIFT) /* Allow domain 0 to change clock */
#  define CCM_CG_AUTH_WHITE_LIST_DOMAIN1  (0x02 << CCM_CG_AUTH_WHITE_LIST_SHIFT) /* Allow domain 1 to change clock */
#  define CCM_CG_AUTH_WHITE_LIST_DOMAIN2  (0x04 << CCM_CG_AUTH_WHITE_LIST_SHIFT) /* Allow domain 2 to change clock */
#  define CCM_CG_AUTH_WHITE_LIST_DOMAIN3  (0x08 << CCM_CG_AUTH_WHITE_LIST_SHIFT) /* Allow domain 3 to change clock */

#define CCM_CG_AUTH_LOCK_LIST             (1 << 12) /* Bit 12:     Lock whitelist setting (LOCK_LIST) */
                                                    /* Bits 13-15: Reserved */
#define CCM_CG_AUTH_DOMAIN_MODE           (1 << 16) /* Bit 16:     Low power and access control by domain (DOMAIN_MODE) */
#define CCM_CG_AUTH_SETPOINT_MODE         (1 << 17) /* Bit 17:     Low power and access control by setpoint (SETPOINT_MODE) */
                                                    /* Bits 18-19: Reserved */
#define CCM_CG_AUTH_LOCK_MODE             (1 << 20) /* Bit 20:     Lock low power and access mode (LOCK_MODE) */
                                                    /* Bits 21-31: Reserved */

