apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_ccm.h
/* Setpoint setting (CLOCK_GROUPn_SETPOINTm, m=0..15, n=0..1) */

#define CCM_CG_SETP_DIV0_SHIFT            (0)       /* Bits 0-3:   Clock divider value in setpoint (DIV0) */
#define CCM_CG_SETP_DIV0_MASK             (0x0f << CCM_CG_SETP_DIV0_SHIFT)
                                                    /* Bits 4-15:  Reserved */
#define CCM_CG_SETP_RSTDIV_SHIFT          (16)      /* Bits 16-23: Clock group global restart count (RSTDIV) */
#define CCM_CG_SETP_RSTDIV_MASK           (0xff << CCM_CG_SETP_RSTDIV_SHIFT)
#define CCM_CG_SETP_OFF                   (1 << 24) /* Bit 24:     Shutdown all locks in clock group (OFF) */
                                                    /* Bits 25-27: Reserved */
#define CCM_CG_SETP_GRADE_SHIFT           (28)      /* Bits 28-31: Indicate speed grade for each setpoint setting (GRADE) */
#define CCM_CG_SETP_GRADE_MASK            (0x0f << CCM_CG_SETP_GRADE_SHIFT)

/* General Purpose Register (GPR_SHAREDn, n=0..7) */

#define CCM_GPR_SH_GPR_SHIFT              (0)       /* Bits 0-31:  General purpose register, shared for all CPU domains (GPR) */
#define CCM_GPR_SH_GPR_MASK               (0xffffffff << CCM_GPR_SH_GPR_SHIFT)

/* General Purpose Register (GPR_SHAREDn_AUTHEN, n=0..7) */

#define CCM_GPR_SH_AUTH_TZ_USER           (1 << 0)  /* Bit 0:      Clock can be changed in user mode (TZ_USER) */
#define CCM_GPR_SH_AUTH_TZ_NS             (1 << 1)  /* Bit 1:      Clock can be changed in non-secure mode (TZ_NS) */
                                                    /* Bits 2-3:   Reserved */
#define CCM_GPR_SH_AUTH_LOCK_TZ           (1 << 4)  /* Bit 4:      Lock TrustZone settings (LOCK_TZ) */
                                                    /* Bits 5-7:   Reserved */

#define CCM_GPR_SH_AUTH_WHITE_LIST_SHIFT     (8)    /* Bits 8-11:  Allow domains to change clock (WHITE_LIST) */
#define CCM_GPR_SH_AUTH_WHITE_LIST_MASK      (0x0f << CCM_GPR_SH_AUTH_WHITE_LIST_SHIFT)
#  define CCM_GPR_SH_AUTH_WHITE_LIST_DOMAIN0 (0x01 << CCM_GPR_SH_AUTH_WHITE_LIST_SHIFT) /* Allow domain 0 to change clock */
#  define CCM_GPR_SH_AUTH_WHITE_LIST_DOMAIN1 (0x02 << CCM_GPR_SH_AUTH_WHITE_LIST_SHIFT) /* Allow domain 1 to change clock */
#  define CCM_GPR_SH_AUTH_WHITE_LIST_DOMAIN2 (0x04 << CCM_GPR_SH_AUTH_WHITE_LIST_SHIFT) /* Allow domain 2 to change clock */
#  define CCM_GPR_SH_AUTH_WHITE_LIST_DOMAIN3 (0x08 << CCM_GPR_SH_AUTH_WHITE_LIST_SHIFT) /* Allow domain 3 to change clock */

#define CCM_GPR_SH_AUTH_LOCK_LIST         (1 << 12) /* Bit 12:     Lock whitelist setting (LOCK_LIST) */
                                                    /* Bits 13-15: Reserved */
#define CCM_GPR_SH_AUTH_DOMAIN_MODE       (1 << 16) /* Bit 16:     Low power and access control by domain (DOMAIN_MODE) */
                                                    /* Bits 17-19: Reserved */
#define CCM_GPR_SH_AUTH_LOCK_MODE         (1 << 20) /* Bit 20:     Lock low power and access mode (LOCK_MODE) */
                                                    /* Bits 21-31: Reserved */

/* General Purpose Register (GPR_PRIVATEn, n=1..7) */

#define CCM_GPR_PR_GPR_SHIFT              (0)       /* Bits 0-31:  General purpose register, with dedicated bits for each domain (GPR) */
#define CCM_GPR_PR_GPR_MASK               (0xffffffff << CCM_GPR_PR_GPR_SHIFT)

/* General Purpose Register (GPR_PRIVATEn_AUTHEN, n=1..7) */

#define CCM_GPR_PR_AUTH_TZ_USER           (1 << 0)  /* Bit 0:      Clock can be changed in user mode (TZ_USER) */
#define CCM_GPR_PR_AUTH_TZ_NS             (1 << 1)  /* Bit 1:      Clock can be changed in non-secure mode (TZ_NS) */
                                                    /* Bits 2-3:   Reserved */
#define CCM_GPR_PR_AUTH_LOCK_TZ           (1 << 4)  /* Bit 4:      Lock TrustZone settings (LOCK_TZ) */
                                                    /* Bits 5-7:   Reserved */

#define CCM_GPR_PR_AUTH_WHITE_LIST_SHIFT     (8)    /* Bits 8-11:  Allow domains to change clock (WHITE_LIST) */
#define CCM_GPR_PR_AUTH_WHITE_LIST_MASK      (0x0f << CCM_GPR_PR_AUTH_WHITE_LIST_SHIFT)
#  define CCM_GPR_PR_AUTH_WHITE_LIST_DOMAIN0 (0x01 << CCM_GPR_PR_AUTH_WHITE_LIST_SHIFT) /* Allow domain 0 to change clock */
#  define CCM_GPR_PR_AUTH_WHITE_LIST_DOMAIN1 (0x02 << CCM_GPR_PR_AUTH_WHITE_LIST_SHIFT) /* Allow domain 1 to change clock */
#  define CCM_GPR_PR_AUTH_WHITE_LIST_DOMAIN2 (0x04 << CCM_GPR_PR_AUTH_WHITE_LIST_SHIFT) /* Allow domain 2 to change clock */
#  define CCM_GPR_PR_AUTH_WHITE_LIST_DOMAIN3 (0x08 << CCM_GPR_PR_AUTH_WHITE_LIST_SHIFT) /* Allow domain 3 to change clock */

#define CCM_GPR_PR_AUTH_LOCK_LIST         (1 << 12) /* Bit 12:     Lock whitelist setting (LOCK_LIST) */
                                                    /* Bits 13-15: Reserved */
#define CCM_GPR_PR_AUTH_DOMAIN_MODE       (1 << 16) /* Bit 16:     Low power and access control by domain (DOMAIN_MODE) */
                                                    /* Bits 17-19: Reserved */
#define CCM_GPR_PR_AUTH_LOCK_MODE         (1 << 20) /* Bit 20:     Lock low power and access mode (LOCK_MODE) */
                                                    /* Bits 21-31: Reserved */

/* Clock source direct control (OSCPLLn_DIRECT, n=0..28) */

#define CCM_OSCPLL_DIR_ON                 (1 << 0)  /* Bit 0:      Turn on clock source (ON) */
                                                    /* Bits 1-31:  Reserved */

/* Clock source domain control (OSCPLLn_DOMAIN, n=0..28) */

#define CCM_OSCPLL_DOM_LEVEL_SHIFT        (0)       /* Bits 0-2:   Current dependence level of this clock source for the current accessing domain (LEVEL) */
#define CCM_OSCPLL_DOM_LEVEL_MASK         (0x07 << CCM_OSCPLL_DOM_LEVEL_SHIFT)
                                                    /* Bits 3-15:  Reserved */
#define CCM_OSCPLL_DOM_LEVEL0_SHIFT       (16)      /* Bits 16-18: Dependence level of this clock source for DOMAIN0 (LEVEL0) */
#define CCM_OSCPLL_DOM_LEVEL0_MASK        (0x07 << CCM_OSCPLL_DOM_LEVEL0_SHIFT)
                                                    /* Bit 31:     Reserved */
#define CCM_OSCPLL_DOM_LEVEL1_SHIFT       (20)      /* Bits 20-22: Dependence level of this clock source for DOMAIN1 (LEVEL1) */
#define CCM_OSCPLL_DOM_LEVEL1_MASK        (0x07 << CCM_OSCPLL_DOM_LEVEL1_SHIFT)
                                                    /* Bit 25:     Reserved */
#define CCM_OSCPLL_DOM_LEVEL2_SHIFT       (24)      /* Bits 24-26: Dependence level of this clock source for DOMAIN2 (LEVEL2) */
#define CCM_OSCPLL_DOM_LEVEL2_MASK        (0x07 << CCM_OSCPLL_DOM_LEVEL2_SHIFT)
                                                    /* Bit 27:     Reserved */
#define CCM_OSCPLL_DOM_LEVEL3_SHIFT       (28)      /* Bits 28-30: Dependence level of this clock source for DOMAIN3 (LEVEL3) */
#define CCM_OSCPLL_DOM_LEVEL3_MASK        (0x07 << CCM_OSCPLL_DOM_LEVEL3_SHIFT)
                                                    /* Bit 31:     Reserved */

/* Clock source setpoint setting (OSCPLLn_SETPOINT, n=0..28) */

#define CCM_OSCPLL_SETP_SETPOINT_SHIFT    (0)       /* Bits 0-15:  Defines 16 setpoint values (SETPOINT) */
#define CCM_OSCPLL_SETP_SETPOINT_MASK     (0xffff << CCM_OSCPLL_SETP_SETPOINT_SHIFT)
#define CCM_OSCPLL_SETP_STANDBY_SHIFT     (16)      /* Bits 16-31: Defines 16 setpoint standby values (STANDBY) */
#define CCM_OSCPLL_SETP_STANDBY_MASK      (0xffff << CCM_OSCPLL_SETP_STANDBY_SHIFT)

