apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_ccm.h
/* Clock source working status (OSCPLLn_STATUS0, n=0..28) */

#define CCM_OSCPLL_STAT0_ON               (1 << 0)  /* Bit 0:      Clock source is turned on (ON) */
                                                    /* Bits 1-3:   Reserved */
#define CCM_OSCPLL_STAT0_STATUS_EARLY     (1 << 4)  /* Bit 4:      Clock source is active (STATUS_EARLY) */
#define CCM_OSCPLL_STAT0_STATUS_LATE      (1 << 5)  /* Bit 5:      Clock source is ready to use (STATUS_LATE) */
                                                    /* Bits 6-7:   Reserved */

#define CCM_OSCPLL_STAT0_ACTIVE_DOMAIN_SHIFT (8)    /* Bits 8-11:  Domains that own this clock source according to whitelist (ACTIVE_DOMAIN) */
#define CCM_OSCPLL_STAT0_ACTIVE_DOMAIN_MASK  (0x0f << CCM_OSCPLL_STAT0_ACTIVE_DOMAIN_SHIFT)
#define CCM_OSCPLL_STAT0_DOMAIN_ENABLE_SHIFT (8)    /* Bits 12-15: Enable status from each domain (DOMAIN_ENABLE) */
#define CCM_OSCPLL_STAT0_DOMAIN_ENABLE_MASK  (0x0f << CCM_OSCPLL_STAT0_DOMAIN_ENABLE_SHIFT)

                                                    /* Bits 16-27: Reserved */
#define CCM_OSCPLL_STAT0_IN_USE           (1 << 28) /* Bit 28:     Indicates whether the clock source is being used by active clock roots (IN_USE) */
                                                    /* Bits 29-31: Reserved */

/* Clock source low power status (OSCPLLn_STATUS1, n=0..28) */

#define CCM_OSCPLL_STAT1_CPU0_MODE_SHIFT  (0)       /* Bits 0-1:   Domain 0 Low Power Mode (CPU0_MODE) */
#define CCM_OSCPLL_STAT1_CPU0_MODE_MASK   (0x03 << CCM_OSCPLL_STAT1_CPU0_MODE_SHIFT)
#  define CCM_OSCPLL_STAT1_CPU0_MODE_RUN  (0x00 << CCM_OSCPLL_STAT1_CPU0_MODE_SHIFT) /* Run */
#  define CCM_OSCPLL_STAT1_CPU0_MODE_WAIT (0x01 << CCM_OSCPLL_STAT1_CPU0_MODE_SHIFT) /* Wait */
#  define CCM_OSCPLL_STAT1_CPU0_MODE_STOP (0x02 << CCM_OSCPLL_STAT1_CPU0_MODE_SHIFT) /* Stop */
#  define CCM_OSCPLL_STAT1_CPU0_MODE_SUSP (0x03 << CCM_OSCPLL_STAT1_CPU0_MODE_SHIFT) /* Suspend */

#define CCM_OSCPLL_STAT1_CPU0_MODE_REQUEST (1 << 2) /* Bit 2:      Domain 0 request to enter Low Power Mode (CPU0_MODE_REQUEST) */

#define CCM_OSCPLL_STAT1_CPU0_MODE_DONE   (1 << 3)  /* Bit 3:      Domain 0 Low Power Mode task done (CPU0_MODE_DONE) */
#define CCM_OSCPLL_STAT1_CPU1_MODE_SHIFT  (4)       /* Bits 4-5:   Domain 1 Low Power Mode (CPU1_MODE) */
#define CCM_OSCPLL_STAT1_CPU1_MODE_MASK   (0x03 << CCM_OSCPLL_STAT1_CPU1_MODE_SHIFT)
#  define CCM_OSCPLL_STAT1_CPU1_MODE_RUN  (0x00 << CCM_OSCPLL_STAT1_CPU1_MODE_SHIFT) /* Run */
#  define CCM_OSCPLL_STAT1_CPU1_MODE_WAIT (0x01 << CCM_OSCPLL_STAT1_CPU1_MODE_SHIFT) /* Wait */
#  define CCM_OSCPLL_STAT1_CPU1_MODE_STOP (0x02 << CCM_OSCPLL_STAT1_CPU1_MODE_SHIFT) /* Stop */
#  define CCM_OSCPLL_STAT1_CPU1_MODE_SUSP (0x03 << CCM_OSCPLL_STAT1_CPU1_MODE_SHIFT) /* Suspend */

#define CCM_OSCPLL_STAT1_CPU1_MODE_REQUEST (1 << 6) /* Bit 6:      Domain 1 request to enter Low Power Mode (CPU1_MODE_REQUEST) */

#define CCM_OSCPLL_STAT1_CPU1_MODE_DONE   (1 << 7)  /* Bit 7:      Domain 1 Low Power Mode task done (CPU1_MODE_DONE) */
#define CCM_OSCPLL_STAT1_CPU2_MODE_SHIFT  (8)       /* Bits 8-9:   Domain 2 Low Power Mode (CPU2_MODE) */
#define CCM_OSCPLL_STAT1_CPU2_MODE_MASK   (0x03 << CCM_OSCPLL_STAT1_CPU2_MODE_SHIFT)
#  define CCM_OSCPLL_STAT1_CPU2_MODE_RUN  (0x00 << CCM_OSCPLL_STAT1_CPU2_MODE_SHIFT) /* Run */
#  define CCM_OSCPLL_STAT1_CPU2_MODE_WAIT (0x01 << CCM_OSCPLL_STAT1_CPU2_MODE_SHIFT) /* Wait */
#  define CCM_OSCPLL_STAT1_CPU2_MODE_STOP (0x02 << CCM_OSCPLL_STAT1_CPU2_MODE_SHIFT) /* Stop */
#  define CCM_OSCPLL_STAT1_CPU2_MODE_SUSP (0x03 << CCM_OSCPLL_STAT1_CPU2_MODE_SHIFT) /* Suspend */

#define CCM_OSCPLL_STAT1_CPU2_MODE_REQUEST (1 << 10) /* Bit 10:    Domain 2 request to enter Low Power Mode (CPU2_MODE_REQUEST) */

#define CCM_OSCPLL_STAT1_CPU2_MODE_DONE   (1 << 11) /* Bit 11:     Domain 2 Low Power Mode task done (CPU2_MODE_DONE) */
#define CCM_OSCPLL_STAT1_CPU3_MODE_SHIFT  (12)      /* Bits 12-13: Domain 3 Low Power Mode (CPU3_MODE) */
#define CCM_OSCPLL_STAT1_CPU3_MODE_MASK   (0x03 << CCM_OSCPLL_STAT1_CPU3_MODE_SHIFT)
#  define CCM_OSCPLL_STAT1_CPU3_MODE_RUN  (0x00 << CCM_OSCPLL_STAT1_CPU3_MODE_SHIFT) /* Run */
#  define CCM_OSCPLL_STAT1_CPU3_MODE_WAIT (0x01 << CCM_OSCPLL_STAT1_CPU3_MODE_SHIFT) /* Wait */
#  define CCM_OSCPLL_STAT1_CPU3_MODE_STOP (0x02 << CCM_OSCPLL_STAT1_CPU3_MODE_SHIFT) /* Stop */
#  define CCM_OSCPLL_STAT1_CPU3_MODE_SUSP (0x03 << CCM_OSCPLL_STAT1_CPU3_MODE_SHIFT) /* Suspend */

#define CCM_OSCPLL_STAT1_CPU3_MODE_REQUEST (1 << 14) /* Bit 14:    Domain 3 request to enter Low Power Mode (CPU3_MODE_REQUEST) */

#define CCM_OSCPLL_STAT1_CPU3_MODE_DONE   (1 << 15) /* Bit 15:     Domain 3 Low Power Mode task done (CPU3_MODE_DONE) */

#define CCM_OSCPLL_STAT1_TARGET_SETPOINT_SHIFT  (16) /* Bits 16-19: Setpoint value to which SoC will switch (TARGET_SETPOINT) */
#define CCM_OSCPLL_STAT1_TARGET_SETPOINT_MASK   (0x0f << CCM_OSCPLL_STAT1_TARGET_SETPOINT_SHIFT)
#define CCM_OSCPLL_STAT1_CURRENT_SETPOINT_SHIFT (20) /* Bits 20-23: Setpoint value in which SoC is currently working (CURRENT_SETPOINT) */
#define CCM_OSCPLL_STAT1_CURRENT_SETPOINT_MASK  (0x0f << CCM_OSCPLL_STAT1_CURRENT_SETPOINT_SHIFT)

#define CCM_OSCPLL_STAT1_SETPOINT_OFF_REQUEST (1 << 24) /* Bit 24: Clock gate turn off request from GPC setpoint (SETPOINT_OFF_REQUEST) */
#define CCM_OSCPLL_STAT1_SETPOINT_OFF_DONE    (1 << 25) /* Bit 25: Clock gate turn off completed (SETPOINT_OFF_DONE) */
#define CCM_OSCPLL_STAT1_SETPOINT_ON_REQUEST  (1 << 26) /* Bit 26: Clock gate turn on request from GPC setpoint (SETPOINT_ON_REQUEST) */
#define CCM_OSCPLL_STAT1_SETPOINT_ON_DONE     (1 << 27) /* Bit 27: Clock gate turn on completed (SETPOINT_ON_DONE) */
#define CCM_OSCPLL_STAT1_STANDBY_IN_REQUEST   (1 << 28) /* Bit 28: Clock gate turn off request from GPC standby (STANDBY_IN_REQUEST) */
#define CCM_OSCPLL_STAT1_STANDBY_IN_DONE      (1 << 29) /* Bit 29: Clock gate turn off completed (STANDBY_IN_DONE) */
#define CCM_OSCPLL_STAT1_STANDBY_OUT_DONE     (1 << 30) /* Bit 30: Clock gate turn on completed (STANDBY_OUT_DONE) */
#define CCM_OSCPLL_STAT1_STANDBY_OUT_REQUEST  (1 << 31) /* Bit 31: Clock gate turn on request from GPC standby (STANDBY_OUT_REQUEST) */

/* Clock source configuration (OSCPLLn_CONFIG, n=0..28) */

