apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_ccm.h
                                                    /* Bit 0:      Reserved */
#define CCM_OSCPLL_CFG_AUTOMODE_PRESENT   (1 << 1)  /* Bit 1:      Automode is implemented (AUTOMODE_PRESENT) */
                                                    /* Bits 2-3:   Reserved */
#define CCM_OSCPLL_CFG_SETPOINT_PRESENT   (1 << 4)  /* Bit 4:      Setpoint is implemented (SETPOINT_PRESENT) */
                                                    /* Bits 5-31:  Reserved */

/* Clock source access control (OSCPLLn_AUTHEN, n=0..28) */

#define CCM_OSCPLL_AUTH_TZ_USER           (1 << 0)  /* Bit 0:      Clock source can be changed in user mode (TZ_USER) */
#define CCM_OSCPLL_AUTH_TZ_NS             (1 << 1)  /* Bit 1:      Clock source can be changed in non-secure mode (TZ_NS) */
                                                    /* Bits 2-3:   Reserved */
#define CCM_OSCPLL_AUTH_LOCK_TZ           (1 << 4)  /* Bit 4:      Lock TrustZone settings (LOCK_TZ) */
                                                    /* Bits 5-7:   Reserved */

#define CCM_OSCPLL_AUTH_WHITE_LIST_SHIFT     (8)    /* Bits 8-11:  Allow domains to change clock (WHITE_LIST) */
#define CCM_OSCPLL_AUTH_WHITE_LIST_MASK      (0x0f << CCM_OSCPLL_AUTH_WHITE_LIST_SHIFT)
#  define CCM_OSCPLL_AUTH_WHITE_LIST_DOMAIN0 (0x01 << CCM_OSCPLL_AUTH_WHITE_LIST_SHIFT) /* Allow domain 0 to change clock */
#  define CCM_OSCPLL_AUTH_WHITE_LIST_DOMAIN1 (0x02 << CCM_OSCPLL_AUTH_WHITE_LIST_SHIFT) /* Allow domain 1 to change clock */
#  define CCM_OSCPLL_AUTH_WHITE_LIST_DOMAIN2 (0x04 << CCM_OSCPLL_AUTH_WHITE_LIST_SHIFT) /* Allow domain 2 to change clock */
#  define CCM_OSCPLL_AUTH_WHITE_LIST_DOMAIN3 (0x08 << CCM_OSCPLL_AUTH_WHITE_LIST_SHIFT) /* Allow domain 3 to change clock */

#define CCM_OSCPLL_AUTH_LOCK_LIST         (1 << 12) /* Bit 12:     Lock whitelist settings (LOCK_LIST) */
                                                    /* Bits 13-15: Reserved */
#define CCM_OSCPLL_AUTH_DOMAIN_MODE       (1 << 16) /* Bit 16:     Low power and access control by domain (DOMAIN_MODE) */
#define CCM_OSCPLL_AUTH_SETPOINT_MODE     (1 << 17) /* Bit 17:     LPCG works in setpoint controlled mode (SETPOINT_MODE) */
#define CCM_OSCPLL_AUTH_CPULPM            (1 << 18) /* Bit 18:     CPU Low Power Mode (CPULPM) */
                                                    /* Bit 19:     Reserved */
#define CCM_OSCPLL_AUTH_LOCK_MODE         (1 << 20) /* Bit 20:     Lock low power and access mode (LOCK_MODE) */
                                                    /* Bits 21-31: Reserved */

/* LPCG direct control (LPCGn_DIRECT, n=0..137) */

#define CCM_LPCG_DIR_ON                   (1 << 0)  /* Bit 0:      LPCG on (ON) */
                                                    /* Bits 1-31:  Reserved */

/* LPCG domain control (LPCGn_DOMAIN, n=0..137) */

#define CCM_LPCG_DOM_LEVEL_SHIFT          (0)       /* Bits 0-2:   Current dependence level of this clock source for the current accessing domain (LEVEL) */
#define CCM_LPCG_DOM_LEVEL_MASK           (0x07 << CCM_LPCG_DOM_LEVEL_SHIFT)
                                                    /* Bits 3-15:  Reserved */
#define CCM_LPCG_DOM_LEVEL0_SHIFT         (16)      /* Bits 16-18: Dependence level of this LPCG for DOMAIN0 (LEVEL0) */
#define CCM_LPCG_DOM_LEVEL0_MASK          (0x07 << CCM_LPCG_DOM_LEVEL0_SHIFT)
                                                    /* Bit 31:     Reserved */
#define CCM_LPCG_DOM_LEVEL1_SHIFT         (20)      /* Bits 20-22: Dependence level of this LPCG for DOMAIN1 (LEVEL1) */
#define CCM_LPCG_DOM_LEVEL1_MASK          (0x07 << CCM_LPCG_DOM_LEVEL1_SHIFT)
                                                    /* Bit 25:     Reserved */
#define CCM_LPCG_DOM_LEVEL2_SHIFT         (24)      /* Bits 24-26: Dependence level of this LPCG for DOMAIN2 (LEVEL2) */
#define CCM_LPCG_DOM_LEVEL2_MASK          (0x07 << CCM_LPCG_DOM_LEVEL2_SHIFT)
                                                    /* Bit 27:     Reserved */
#define CCM_LPCG_DOM_LEVEL3_SHIFT         (28)      /* Bits 28-30: Dependence level of this LPCG for DOMAIN3 (LEVEL3) */
#define CCM_LPCG_DOM_LEVEL3_MASK          (0x07 << CCM_LPCG_DOM_LEVEL3_SHIFT)
                                                    /* Bit 31:     Reserved */

/* LPCG working status (LPCGn_STATUS0, n=0..137) */

#define CCM_LPCG_STAT0_ON                 (1 << 0)  /* Bit 0:      Clock source is turned on (ON) */
                                                    /* Bits 1-7:   Reserved */

#define CCM_LPCG_STAT0_ACTIVE_DOMAIN_SHIFT (8)      /* Bits 8-11:  Domains that own this clock source according to whitelist (ACTIVE_DOMAIN) */
#define CCM_LPCG_STAT0_ACTIVE_DOMAIN_MASK  (0x0f << CCM_LPCG_STAT0_ACTIVE_DOMAIN_SHIFT)
#define CCM_LPCG_STAT0_DOMAIN_ENABLE_SHIFT (8)      /* Bits 12-15: Enable status from each domain (DOMAIN_ENABLE) */
#define CCM_LPCG_STAT0_DOMAIN_ENABLE_MASK  (0x0f << CCM_LPCG_STAT0_DOMAIN_ENABLE_SHIFT)
                                                    /* Bits 16-31: Reserved */

/* LPCG low power status (LPCGn_STATUS1, n=0..137) */

#define CCM_LPCG_STAT1_CPU0_MODE_SHIFT    (0)       /* Bits 0-1:   Domain 0 Low Power Mode (CPU0_MODE) */
#define CCM_LPCG_STAT1_CPU0_MODE_MASK     (0x03 << CCM_LPCG_STAT1_CPU0_MODE_SHIFT)
#  define CCM_LPCG_STAT1_CPU0_MODE_RUN    (0x00 << CCM_LPCG_STAT1_CPU0_MODE_SHIFT) /* Run */
#  define CCM_LPCG_STAT1_CPU0_MODE_WAIT   (0x01 << CCM_LPCG_STAT1_CPU0_MODE_SHIFT) /* Wait */
#  define CCM_LPCG_STAT1_CPU0_MODE_STOP   (0x02 << CCM_LPCG_STAT1_CPU0_MODE_SHIFT) /* Stop */
#  define CCM_LPCG_STAT1_CPU0_MODE_SUSP   (0x03 << CCM_LPCG_STAT1_CPU0_MODE_SHIFT) /* Suspend */

#define CCM_LPCG_STAT1_CPU0_MODE_REQUEST  (1 << 2)  /* Bit 2:      Domain 0 request to enter Low Power Mode (CPU0_MODE_REQUEST) */
#define CCM_LPCG_STAT1_CPU0_MODE_DONE     (1 << 3)  /* Bit 3:      Domain 0 Low Power Mode task done (CPU0_MODE_DONE) */
#define CCM_LPCG_STAT1_CPU1_MODE_SHIFT    (4)       /* Bits 4-5:   Domain 1 Low Power Mode (CPU1_MODE) */
#define CCM_LPCG_STAT1_CPU1_MODE_MASK     (0x03 << CCM_LPCG_STAT1_CPU1_MODE_SHIFT)
#  define CCM_LPCG_STAT1_CPU1_MODE_RUN    (0x00 << CCM_LPCG_STAT1_CPU1_MODE_SHIFT) /* Run */
#  define CCM_LPCG_STAT1_CPU1_MODE_WAIT   (0x01 << CCM_LPCG_STAT1_CPU1_MODE_SHIFT) /* Wait */
#  define CCM_LPCG_STAT1_CPU1_MODE_STOP   (0x02 << CCM_LPCG_STAT1_CPU1_MODE_SHIFT) /* Stop */
#  define CCM_LPCG_STAT1_CPU1_MODE_SUSP   (0x03 << CCM_LPCG_STAT1_CPU1_MODE_SHIFT) /* Suspend */

