apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_ccm.h
#define CCM_LPCG_STAT1_CPU1_MODE_REQUEST (1 << 6)  /* Bit 6:      Domain 1 request to enter Low Power Mode (CPU1_MODE_REQUEST) */
#define CCM_LPCG_STAT1_CPU1_MODE_DONE    (1 << 7)  /* Bit 7:      Domain 1 Low Power Mode task done (CPU1_MODE_DONE) */
#define CCM_LPCG_STAT1_CPU2_MODE_SHIFT   (8)       /* Bits 8-9:   Domain 2 Low Power Mode (CPU2_MODE) */
#define CCM_LPCG_STAT1_CPU2_MODE_MASK    (0x03 << CCM_LPCG_STAT1_CPU2_MODE_SHIFT)
#  define CCM_LPCG_STAT1_CPU2_MODE_RUN   (0x00 << CCM_LPCG_STAT1_CPU2_MODE_SHIFT) /* Run */
#  define CCM_LPCG_STAT1_CPU2_MODE_WAIT  (0x01 << CCM_LPCG_STAT1_CPU2_MODE_SHIFT) /* Wait */
#  define CCM_LPCG_STAT1_CPU2_MODE_STOP  (0x02 << CCM_LPCG_STAT1_CPU2_MODE_SHIFT) /* Stop */
#  define CCM_LPCG_STAT1_CPU2_MODE_SUSP  (0x03 << CCM_LPCG_STAT1_CPU2_MODE_SHIFT) /* Suspend */

#define CCM_LPCG_STAT1_CPU2_MODE_REQUEST (1 << 10) /* Bit 10:     Domain 2 request to enter Low Power Mode (CPU2_MODE_REQUEST) */
#define CCM_LPCG_STAT1_CPU2_MODE_DONE    (1 << 11) /* Bit 11:     Domain 2 Low Power Mode task done (CPU2_MODE_DONE) */
#define CCM_LPCG_STAT1_CPU3_MODE_SHIFT   (12)      /* Bits 12-13: Domain 3 Low Power Mode (CPU3_MODE) */
#define CCM_LPCG_STAT1_CPU3_MODE_MASK    (0x03 << CCM_LPCG_STAT1_CPU3_MODE_SHIFT)
#  define CCM_LPCG_STAT1_CPU3_MODE_RUN   (0x00 << CCM_LPCG_STAT1_CPU3_MODE_SHIFT) /* Run */
#  define CCM_LPCG_STAT1_CPU3_MODE_WAIT  (0x01 << CCM_LPCG_STAT1_CPU3_MODE_SHIFT) /* Wait */
#  define CCM_LPCG_STAT1_CPU3_MODE_STOP  (0x02 << CCM_LPCG_STAT1_CPU3_MODE_SHIFT) /* Stop */
#  define CCM_LPCG_STAT1_CPU3_MODE_SUSP  (0x03 << CCM_LPCG_STAT1_CPU3_MODE_SHIFT) /* Suspend */

#define CCM_LPCG_STAT1_CPU3_MODE_REQUEST (1 << 14) /* Bit 14:     Domain 3 request to enter Low Power Mode (CPU3_MODE_REQUEST) */
#define CCM_LPCG_STAT1_CPU3_MODE_DONE    (1 << 15) /* Bit 15:     Domain 3 Low Power Mode task done (CPU3_MODE_DONE) */

#define CCM_LPCG_STAT1_TARGET_SETPOINT_SHIFT  (16) /* Bits 16-19: Setpoint value the SoC will switch to (TARGET_SETPOINT) */
#define CCM_LPCG_STAT1_TARGET_SETPOINT_MASK   (0x0f << CCM_LPCG_STAT1_TARGET_SETPOINT_SHIFT)
#define CCM_LPCG_STAT1_CURRENT_SETPOINT_SHIFT (20) /* Bits 20-23: Setpoint value the SoC is currently working in (CURRENT_SETPOINT) */
#define CCM_LPCG_STAT1_CURRENT_SETPOINT_MASK  (0x0f << CCM_LPCG_STAT1_CURRENT_SETPOINT_SHIFT)

#define CCM_LPCG_STAT1_SETPOINT_OFF_REQUEST (1 << 24) /* Bit 24: Clock gate turn off request from GPC setpoint (SETPOINT_OFF_REQUEST) */
#define CCM_LPCG_STAT1_SETPOINT_OFF_DONE    (1 << 25) /* Bit 25: Clock gate turn off completed (SETPOINT_OFF_DONE) */
#define CCM_LPCG_STAT1_SETPOINT_ON_REQUEST  (1 << 26) /* Bit 26: Clock gate turn on request from GPC setpoint (SETPOINT_ON_REQUEST) */
#define CCM_LPCG_STAT1_SETPOINT_ON_DONE     (1 << 27) /* Bit 27: Clock gate turn on completed (SETPOINT_ON_DONE) */
                                                      /* Bits 28-31: Reserved */

/* LPCG configuration (LPCGn_CONFIG, n=0..137) */

                                                    /* Bits 0-3:   Reserved */
#define CCM_LPCG_CFG_SETPOINT_PRESENT     (1 << 4)  /* Bit 4:      Setpoint is implemented (SETPOINT_PRESENT) */
                                                    /* Bits 5-31:  Reserved */

/* LPCG access control (LPCGn_AUTHEN, n=0..137) */

#define CCM_LPCG_AUTH_TZ_USER             (1 << 0)  /* Bit 0:      LPCG can be changed in user mode (TZ_USER) */
#define CCM_LPCG_AUTH_TZ_NS               (1 << 1)  /* Bit 1:      LPCG can be changed in non-secure mode (TZ_NS) */
                                                    /* Bits 2-3:   Reserved */
#define CCM_LPCG_AUTH_LOCK_TZ             (1 << 4)  /* Bit 4:      Lock TrustZone settings (LOCK_TZ) */
                                                    /* Bits 5-7:   Reserved */

#define CCM_LPCG_AUTH_WHITE_LIST_SHIFT     (8)      /* Bits 8-11:  Allow domains to change clock root (WHITE_LIST) */
#define CCM_LPCG_AUTH_WHITE_LIST_MASK      (0x0f << CCM_LPCG_AUTH_WHITE_LIST_SHIFT)
#  define CCM_LPCG_AUTH_WHITE_LIST_DOMAIN0 (0x01 << CCM_LPCG_AUTH_WHITE_LIST_SHIFT) /* Allow domain 0 to change clock root */
#  define CCM_LPCG_AUTH_WHITE_LIST_DOMAIN1 (0x02 << CCM_LPCG_AUTH_WHITE_LIST_SHIFT) /* Allow domain 1 to change clock root */
#  define CCM_LPCG_AUTH_WHITE_LIST_DOMAIN2 (0x04 << CCM_LPCG_AUTH_WHITE_LIST_SHIFT) /* Allow domain 2 to change clock root */
#  define CCM_LPCG_AUTH_WHITE_LIST_DOMAIN3 (0x08 << CCM_LPCG_AUTH_WHITE_LIST_SHIFT) /* Allow domain 3 to change clock root */

#define CCM_LPCG_AUTH_LOCK_LIST           (1 << 12) /* Bit 12:     Lock whitelist settings (LOCK_LIST) */
                                                    /* Bits 13-15: Reserved */
#define CCM_LPCG_AUTH_DOMAIN_MODE         (1 << 16) /* Bit 16:     Low power and access control by domain (DOMAIN_MODE) */
#define CCM_LPCG_AUTH_SETPOINT_MODE       (1 << 17) /* Bit 17:     LPCG works in setpoint controlled mode (SETPOINT_MODE) */
#define CCM_LPCG_AUTH_CPULPM              (1 << 18) /* Bit 18:     LPCG works in CPU Low Power Mode (CPULPM) */
                                                    /* Bit 19:     Reserved */
#define CCM_LPCG_AUTH_LOCK_MODE           (1 << 20) /* Bit 20:     Lock low power and access mode (LOCK_MODE) */
                                                    /* Bits 21-31: Reserved */

/* LPCG setpoint setting (LPCGn_SETPOINT, n=2..48) */

#define CCM_LPCG_SETP_SETPOINT_SHIFT      (0)       /* Bits 0-15: Defines 16 setpoint values (SETPOINT) */
#define CCM_LPCG_SETP_SETPOINT_MASK       (0xffff << CCM_LPCG_SETP_SETPOINT_SHIFT)
#define CCM_LPCG_SETP_STANDBY_SHIFT       (16)      /* Bits 16-31: Defines 16 setpoint standby values (STANDBY) */
#define CCM_LPCG_SETP_STANDBY_MASK        (0xffff << CCM_LPCG_SETP_STANDBY_SHIFT)

/* Clock Roots */

#define CCM_CR_M7          0  /* CLOCK ROOT M7. */
#define CCM_CR_M4          1  /* CLOCK ROOT M4. */
#define CCM_CR_BUS         2  /* CLOCK ROOT BUS. */
#define CCM_CR_BUS_LPSR    3  /* CLOCK ROOT BUS LPSR. */
#define CCM_CR_SEMC        4  /* CLOCK ROOT SEMC. */
#define CCM_CR_CSSYS       5  /* CLOCK ROOT CSSYS. */
#define CCM_CR_CSTRACE     6  /* CLOCK ROOT CSTRACE. */
#define CCM_CR_M4_SYSTICK  7  /* CLOCK ROOT M4 SYSTICK. */
#define CCM_CR_M7_SYSTICK  8  /* CLOCK ROOT M7 SYSTICK. */
#define CCM_CR_ADC1        9  /* CLOCK ROOT ADC1. */
#define CCM_CR_ADC2        10 /* CLOCK ROOT ADC2. */
#define CCM_CR_ACMP        11 /* CLOCK ROOT ACMP. */
#define CCM_CR_FLEXIO1     12 /* CLOCK ROOT FLEXIO1. */
#define CCM_CR_FLEXIO2     13 /* CLOCK ROOT FLEXIO2. */
#define CCM_CR_GPT1        14 /* CLOCK ROOT GPT1. */
#define CCM_CR_GPT2        15 /* CLOCK ROOT GPT2. */
#define CCM_CR_GPT3        16 /* CLOCK ROOT GPT3. */
#define CCM_CR_GPT4        17 /* CLOCK ROOT GPT4. */
#define CCM_CR_GPT5        18 /* CLOCK ROOT GPT5. */
#define CCM_CR_GPT6        19 /* CLOCK ROOT GPT6. */
#define CCM_CR_FLEXSPI1    20 /* CLOCK ROOT FLEXSPI1. */
#define CCM_CR_FLEXSPI2    21 /* CLOCK ROOT FLEXSPI2. */
#define CCM_CR_CAN1        22 /* CLOCK ROOT CAN1. */
#define CCM_CR_CAN2        23 /* CLOCK ROOT CAN2. */
#define CCM_CR_CAN3        24 /* CLOCK ROOT CAN3. */
#define CCM_CR_LPUART1     25 /* CLOCK ROOT LPUART1. */
#define CCM_CR_LPUART2     26 /* CLOCK ROOT LPUART2. */
#define CCM_CR_LPUART3     27 /* CLOCK ROOT LPUART3. */
#define CCM_CR_LPUART4     28 /* CLOCK ROOT LPUART4. */
#define CCM_CR_LPUART5     29 /* CLOCK ROOT LPUART5. */
#define CCM_CR_LPUART6     30 /* CLOCK ROOT LPUART6. */
#define CCM_CR_LPUART7     31 /* CLOCK ROOT LPUART7. */
#define CCM_CR_LPUART8     32 /* CLOCK ROOT LPUART8. */
#define CCM_CR_LPUART9     33 /* CLOCK ROOT LPUART9. */
#define CCM_CR_LPUART10    34 /* CLOCK ROOT LPUART10. */
#define CCM_CR_LPUART11    35 /* CLOCK ROOT LPUART11. */
#define CCM_CR_LPUART12    36 /* CLOCK ROOT LPUART12. */
#define CCM_CR_LPI2C1      37 /* CLOCK ROOT LPI2C1. */
#define CCM_CR_LPI2C2      38 /* CLOCK ROOT LPI2C2. */
#define CCM_CR_LPI2C3      39 /* CLOCK ROOT LPI2C3. */
#define CCM_CR_LPI2C4      40 /* CLOCK ROOT LPI2C4. */
#define CCM_CR_LPI2C5      41 /* CLOCK ROOT LPI2C5. */
#define CCM_CR_LPI2C6      42 /* CLOCK ROOT LPI2C6. */
#define CCM_CR_LPSPI1      43 /* CLOCK ROOT LPSPI1. */
#define CCM_CR_LPSPI2      44 /* CLOCK ROOT LPSPI2. */
#define CCM_CR_LPSPI3      45 /* CLOCK ROOT LPSPI3. */
#define CCM_CR_LPSPI4      46 /* CLOCK ROOT LPSPI4. */
#define CCM_CR_LPSPI5      47 /* CLOCK ROOT LPSPI5. */
#define CCM_CR_LPSPI6      48 /* CLOCK ROOT LPSPI6. */
#define CCM_CR_EMV1        49 /* CLOCK ROOT EMV1. */
#define CCM_CR_EMV2        50 /* CLOCK ROOT EMV2. */
#define CCM_CR_ENET1       51 /* CLOCK ROOT ENET1. */
#define CCM_CR_ENET2       52 /* CLOCK ROOT ENET2. */
#define CCM_CR_ENET_QOS    53 /* CLOCK ROOT ENET QOS. */
#define CCM_CR_ENET_25M    54 /* CLOCK ROOT ENET 25M. */
#define CCM_CR_ENET_TIMER1 55 /* CLOCK ROOT ENET TIMER1. */
#define CCM_CR_ENET_TIMER2 56 /* CLOCK ROOT ENET TIMER2. */
#define CCM_CR_ENET_TIMER3 57 /* CLOCK ROOT ENET TIMER3. */
#define CCM_CR_USDHC1      58 /* CLOCK ROOT USDHC1. */
#define CCM_CR_USDHC2      59 /* CLOCK ROOT USDHC2. */
#define CCM_CR_ASRC        60 /* CLOCK ROOT ASRC. */
#define CCM_CR_MQS         61 /* CLOCK ROOT MQS. */
#define CCM_CR_MIC         62 /* CLOCK ROOT MIC. */
#define CCM_CR_SPDIF       63 /* CLOCK ROOT SPDIF */
#define CCM_CR_SAI1        64 /* CLOCK ROOT SAI1. */
#define CCM_CR_SAI2        65 /* CLOCK ROOT SAI2. */
#define CCM_CR_SAI3        66 /* CLOCK ROOT SAI3. */
#define CCM_CR_SAI4        67 /* CLOCK ROOT SAI4. */
#define CCM_CR_GC355       68 /* CLOCK ROOT GC355. */
#define CCM_CR_LCDIF       69 /* CLOCK ROOT LCDIF. */
#define CCM_CR_LCDIFV2     70 /* CLOCK ROOT LCDIFV2. */
#define CCM_CR_MIPI_REF    71 /* CLOCK ROOT MIPI REF. */
#define CCM_CR_MIPI_ESC    72 /* CLOCK ROOT MIPI ESC. */
#define CCM_CR_CSI2        73 /* CLOCK ROOT CSI2. */
#define CCM_CR_CSI2_ESC    74 /* CLOCK ROOT CSI2 ESC. */
#define CCM_CR_CSI2_UI     75 /* CLOCK ROOT CSI2 UI. */
#define CCM_CR_CSI         76 /* CLOCK ROOT CSI. */
#define CCM_CR_CKO1        77 /* CLOCK ROOT CKO1. */
#define CCM_CR_CKO2        78 /* CLOCK ROOT CKO2. */

/* Note IMXRT7 uses the definition LPCG instead of CCGR as the clock gate
 * register but for compatiblity we define them as LPCG
 */

#define CCM_CG_OFF                               (0)  /* Clock is off during all modes */
#define CCM_CG_RUN                               (1)  /* Clock is on in run mode, but off in WAIT and STOP modes */
#define CCM_CG_ALL                               (3)  /* Clock is on during all modes, except STOP mode. */

#define CCM_CCGR_M7                           0
#define CCM_CCGR_M4                           1
#define CCM_CCGR_SIM_M7                       2
#define CCM_CCGR_SIM_M                        3
#define CCM_CCGR_SIM_DISP                     4
#define CCM_CCGR_SIM_PER                      5
#define CCM_CCGR_SIM_LPSR                     6
#define CCM_CCGR_ANADIG                       7
#define CCM_CCGR_DCDC                         8
#define CCM_CCGR_SRC                          9
#define CCM_CCGR_CCM                         10
#define CCM_CCGR_GPC                         11
#define CCM_CCGR_SSARC                       12
#define CCM_CCGR_SIM_R                       13
#define CCM_CCGR_WDOG1                       14
#define CCM_CCGR_WDOG2                       15
#define CCM_CCGR_WDOG3                       16
#define CCM_CCGR_WDOG4                       17
#define CCM_CCGR_EWM0                        18
#define CCM_CCGR_SEMA                        19
#define CCM_CCGR_MU_A                        20
#define CCM_CCGR_MU_B                        21
#define CCM_CCGR_EDMA                        22
#define CCM_CCGR_EDMA_LPSR                   23
#define CCM_CCGR_ROMCP                       24
#define CCM_CCGR_OCRAM                       25
#define CCM_CCGR_FLEXRAM                     26
#define CCM_CCGR_LMEM                        27
#define CCM_CCGR_FLEXSPI1                    28
#define CCM_CCGR_FLEXSPI2                    29
#define CCM_CCGR_RDC                         30
#define CCM_CCGR_M7_XRDC                     31
#define CCM_CCGR_M4_XRDC                     32
#define CCM_CCGR_SEMC                        33
#define CCM_CCGR_XECC                        34
#define CCM_CCGR_IEE                         35
#define CCM_CCGR_KEY_MANAGER                 36
#define CCM_CCGR_PUF                         36
#define CCM_CCGR_OCOTP_CTRL                  37 //Note Added CTRL for compatiblity
#define CCM_CCGR_SNVS_HP                     38
#define CCM_CCGR_SNVS                        39
#define CCM_CCGR_CAAM                        40
#define CCM_CCGR_JTAG_MUX                    41
#define CCM_CCGR_CSTRACE                     42
#define CCM_CCGR_XBAR1                       43
#define CCM_CCGR_XBAR2                       44
#define CCM_CCGR_XBAR3                       45
#define CCM_CCGR_AOI1                        46
#define CCM_CCGR_AOI2                        47
#define CCM_CCGR_ADC_ETC                     48
#define CCM_CCGR_IOMUXC                      49
#define CCM_CCGR_IOMUXC_LPSR                 50
#define CCM_CCGR_GPIO                        51
#define CCM_CCGR_KPP                         52
#define CCM_CCGR_FLEXIO1                     53
#define CCM_CCGR_FLEXIO2                     54
#define CCM_CCGR_ADC1                        55
#define CCM_CCGR_ADC2                        56
#define CCM_CCGR_DAC                         57
#define CCM_CCGR_ACMP1                       58
#define CCM_CCGR_ACMP2                       59
#define CCM_CCGR_ACMP3                       60
#define CCM_CCGR_ACMP4                       61
#define CCM_CCGR_PIT1                        62
#define CCM_CCGR_PIT2                        63
#define CCM_CCGR_GPT1                        64
#define CCM_CCGR_GPT2                        65
#define CCM_CCGR_GPT3                        66
#define CCM_CCGR_GPT4                        67
#define CCM_CCGR_GPT5                        68
#define CCM_CCGR_GPT6                        69
#define CCM_CCGR_TIMER1                      70
#define CCM_CCGR_TIMER2                      71
#define CCM_CCGR_TIMER3                      72
#define CCM_CCGR_QTIMER4                     73
#define CCM_CCGR_ENC1                        74
#define CCM_CCGR_ENC2                        75
#define CCM_CCGR_ENC3                        76
#define CCM_CCGR_ENC4                        77
#define CCM_CCGR_HRTIMER                     78
#define CCM_CCGR_PWM1                        79
#define CCM_CCGR_PWM2                        80
#define CCM_CCGR_PWM3                        81
#define CCM_CCGR_PWM4                        82
#define CCM_CCGR_CAN1                        83
#define CCM_CCGR_CAN2                        84
#define CCM_CCGR_CAN3                        85
#define CCM_CCGR_LPUART1                     86
#define CCM_CCGR_LPUART2                     87
#define CCM_CCGR_LPUART3                     88
#define CCM_CCGR_LPUART4                     89
#define CCM_CCGR_LPUART5                     90
#define CCM_CCGR_LPUART6                     91
#define CCM_CCGR_LPUART7                     92
#define CCM_CCGR_LPUART8                     93
#define CCM_CCGR_LPUART9                     94
#define CCM_CCGR_LPUART10                    95
#define CCM_CCGR_LPUART11                    96
#define CCM_CCGR_LPUART12                    97
#define CCM_CCGR_LPI2C1                      98
#define CCM_CCGR_LPI2C2                      99
#define CCM_CCGR_LPI2C3                     100
#define CCM_CCGR_LPI2C4                     101
#define CCM_CCGR_LPI2C5                     102
#define CCM_CCGR_LPI2C6                     103
#define CCM_CCGR_LPSPI1                     104
#define CCM_CCGR_LPSPI2                     105
#define CCM_CCGR_LPSPI3                     106
#define CCM_CCGR_LPSPI4                     107
#define CCM_CCGR_LPSPI5                     108
#define CCM_CCGR_LPSPI6                     109
#define CCM_CCGR_SIM1                       110
#define CCM_CCGR_SIM2                       111
#define CCM_CCGR_ENET                       112
#define CCM_CCGR_ENET_1G                    113
#define CCM_CCGR_ENET_QOS                   114
#define CCM_CCGR_USB                        115
#define CCM_CCGR_CDOG                       116
#define CCM_CCGR_USDHC1                     117
#define CCM_CCGR_USDHC2                     118
#define CCM_CCGR_ASRC                       119
#define CCM_CCGR_MQS                        120
#define CCM_CCGR_PDM                        121
#define CCM_CCGR_SPDIF                      122
#define CCM_CCGR_SAI1                       123
#define CCM_CCGR_SAI2                       124
#define CCM_CCGR_SAI3                       125
#define CCM_CCGR_SAI4                       126
#define CCM_CCGR_PXP                        127
#define CCM_CCGR_GPU2D                      128
#define CCM_CCGR_LCDIF                      129
#define CCM_CCGR_LCDIFV2                    130
#define CCM_CCGR_MIPI_DSI                   131
#define CCM_CCGR_MIPI_CSI                   132
#define CCM_CCGR_CSI                        133
#define CCM_CCGR_DCIC_MIPI                  134
#define CCM_CCGR_DCIC_LCD                   135
#define CCM_CCGR_VIDEO_MUX                  136
#define CCM_CCGR_UNIQ_EDT_I                 137

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_CCM_H */
